var area2text = ["北京市", "天津市", "河北省", "山西省", "内蒙古自治区", "辽宁省", "吉林省", "黑龙江省", "上海市", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西壮族自治区", "海南省", "重庆市", "四川省", "贵州省", "云南省", "西藏自治区", "陕西省", "甘肃省", "青海省", "宁夏回族自治区", "新疆维吾尔自治区"];

var subarea2text = [["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"], ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "滨海新区", "宁河区", "静海区", "蓟州区"], ["石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"], ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"], ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"], ["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"], ["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"], ["哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "大兴安岭地区"], ["黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明区"], ["南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市"], ["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"], ["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "六安市", "亳州市", "池州市", "宣城市"], ["福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"], ["南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"], ["济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市"], ["郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市", "济源市"], ["武汉市", "黄石市", "十堰市", "宜昌市", "襄阳市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "恩施土家族苗族自治州", "仙桃市", "潜江市", "天门市", "神农架林区"], ["长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西土家族苗族自治州"], ["广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"], ["南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"], ["海口市", "三亚市", "三沙市", "儋州市", "五指山市", "琼海市", "文昌市", "万宁市", "东方市", "定安县", "屯昌县", "澄迈县", "临高县", "白沙黎族自治县", "昌江黎族自治县", "乐东黎族自治县", "陵水黎族自治县", "保亭黎族苗族自治县", "琼中黎族苗族自治县"], ["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "綦江区", "大足区", "渝北区", "巴南区", "黔江区", "长寿区", "江津区", "合川区", "永川区", "南川区", "璧山区", "铜梁区", "潼南区", "荣昌区", "开州区", "梁平区", "武隆区", "城口县", "丰都县", "垫江县", "忠县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"], ["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"], ["贵阳市", "六盘水市", "遵义市", "安顺市", "毕节市", "铜仁市", "黔西南布依族苗族自治州", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"], ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "普洱市", "临沧市", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"], ["拉萨市", "日喀则市", "昌都市", "林芝市", "山南市", "那曲市", "阿里地区"], ["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市"], ["兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "临夏回族自治州", "甘南藏族自治州"], ["西宁市", "海东市", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"], ["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"], ["乌鲁木齐市", "克拉玛依市", "吐鲁番市", "哈密市", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州", "喀什地区", "和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "石河子市", "阿拉尔市", "图木舒克市", "五家渠市", "北屯市", "铁门关市", "双河市", "可克达拉市", "昆玉市", "胡杨河市", "新星市"]]

var list = [["江苏省", "苏州市", 1, "苏州「晓月」雀庄", "晓月"], ["江苏省", "徐州市", 1, "咸师傅接待馆", "咸师傅"], ["广西省", "南宁市", 1, "【白龍桌遊俱樂部】", "白龙"], ["吉林省", "长春市", 1, "【芸锋宾馆】", "芸锋"], ["山东省", "济南市", 1, "济南麒缘雀庄", "麒缘"], ["山东省", "济南市", 1, "天宇", "天宇"], ["山东省", "济南市", 1, "济南明湖雀庄", "明湖"], ["广东省", "深圳市", 1, "【深圳国士无双智竞馆】", "国士无双"], ["广东省", "深圳市", 1, "娜塔莉亚断幺馆", "娜塔莉亚"], ["天津市", "河东区", 1, "多来雀庄/天津立直麻雀同好会", "多来雀庄"], ["广东省", "东莞市", 1, "东莞浪速·铜雀日麻室", "浪速铜雀"], ["山东省", "青岛市", 1, "青岛浪速·梓泽雀庄", "青岛浪速"], ["广东省", "广州市", 1, "日進麻雀部室", "日进"], ["广东省", "广州市", 1, "广州岭上雀庄", "岭上雀庄"], ["广东省", "江门市", 1, "江门御樱山雀庄", "御樱山"], ["广东省", "中山市", 1, "nakayama格斗日麻俱乐部", "NAKAYAMA"], ["广东省", "广州市", 1, "广州浪速·立直雀庄", "立直浪速"], ["江苏省", "南京市", 1, "南京浪速·总店", "浪速总店"], ["江苏省", "南京市", 1, "南京浪速·弘阳广场店", "浪速江北"], ["江苏省", "南京市", 1, "南京浪速·仙林大学城店", "浪速仙林"], ["江苏省", "南京市", 1, "鲸蓝雀庄·翠屏山店", "鲸蓝"], ["江苏省", "南京市", 1, "南京浪速·江宁大学城店", "浪速江宁"], ["江苏省", "南京市", 1, "南京浪速·高淳店", "浪速高淳"], ["陕西省", "西安市", 1, "约嘛棋牌", "约嘛"], ["陕西省", "西安市", 1, "天和雀庄", "天和"], ["江苏省", "无锡市", 1, "无锡浪速·盼大雀庄", "无锡浪速"], ["江苏省", "常州市", 1, "常州浪速·八幡雀庄", "常州浪速"], ["陕西省", "西安市", 1, "幺玖雀庄", "幺玖"], ["湖南省", "长沙市", 1, "东方红智竞馆", "东方红"], ["湖南省", "长沙市", 1, "雁南飞立直club", "雁南飞"], ["上海市", "徐汇区", 1, "平和日麻桌游俱乐部", "平和"], ["广东省", "汕头市", 1, "潮汕立直麻将俱乐部", "潮立协"], ["河南省", "郑州市", 1, "洛神雀庄", "洛神"], ["湖南省", "长沙市", 1, "九曜雀庄", "九曜"], ["江西省", "南昌市", 1, "南昌浪速·四季雀庄", "浪速四季"], ["云南省", "昆明市", 1, "旺角", "旺角"], ["云南省", "昆明市", 1, "昆明龍凰日麻俱乐部", "龙凰"], ["辽宁省", "锦州市", 1, "雀芯俱乐部", "雀芯"], ["辽宁省", "鞍山市", 1, "三元钢城馆", "三元钢城"], ["辽宁省", "抚顺市", 1, "抚顺乐道立直麻将快乐屋", "乐道"], ["辽宁省", "铁岭市", 1, "辽宁铁岭激流俱乐部", "激流"], ["辽宁省", "沈阳市", 1, "沈阳立直麻将联盟【金穗店】", "沈联金穗"], ["辽宁省", "沈阳市", 1, "沈北春田雀庄", "春田"], ["辽宁省", "沈阳市", 1, "沈阳立直麻将联盟·三好店", "沈联三好店"], ["辽宁省", "沈阳市", 1, "同福雀庄", "同福"], ["辽宁省", "沈阳市", 1, "清平雀庄", "清平"], ["安徽省", "马鞍山市", 1, "菠萝屋", "菠萝屋"], ["安徽省", "合肥市", 1, "三倍满雀庄", "三倍满"], ["安徽省", "合肥市", 1, "宅天屋", "宅天屋"], ["湖北省", "武汉市", 1, "铁机路日麻基地", "铁机路"], ["湖北省", "武汉市", 1, "七星雀庄·武汉", "七星"], ["湖北省", "武汉市", 1, "九月雀庄·武汉", "九月"], ["湖北省", "武汉市", 1, "云岭雀庄", "云岭"], ["湖北省", "武汉市", 1, "天缘雀庄·武汉", "天缘"], ["湖北省", "武汉市", 1, "云岭雀庄（光谷店）", "云岭二店"], ["上海市", "长宁区", 1, "臣海", "臣海"], ["上海市", "普陀区", 1, "MG斗牌电竞俱乐部", "MG斗牌"], ["上海市", "松江区", 1, "ALL LAST日麻桌游体验馆", "ALLLAST"], ["上海市", "长宁区", 1, "大好き雀庄", "大好"], ["上海市", "长宁区", 1, "隐居北斗", "北斗"], ["上海市", "徐汇区", 1, "米花桌游日麻俱乐部", "米花"], ["上海市", "普陀区", 1, "闪亮亮日麻桌游社", "闪亮亮"], ["上海市", "宝山区", 1, "圆橙立直麻将俱乐部", "圆橙"], ["山西省", "太原市", 1, "太原凤栖立直麻将同好会", "凤栖"], ["上海市", "浦东新区", 1, "柴柴日麻桌游馆", "柴柴"], ["上海市", "杨浦区", 1, "查米桌游日麻体验店（江浦店）", "查米"], ["北京市", "东城区", 1, "雀萌", "雀萌"], ["北京市", "朝阳区", 1, "三国鼎盛茶楼大屯店", "三国"], ["重庆市", "渝中区", 1, "千夜雀庄", "千夜"], ["北京市", "海淀区", 1, "三元桌游•立直麻雀", "三元"], ["北京市", "海淀区", 1, "北京冷面雀庄", "冷面"], ["浙江省", "宁波市", 1, "【猎人梦境】", "猎人梦境"], ["浙江省", "台州市", 1, "【花鸟风月】", "花鸟风月"], ["浙江省", "金华市", 1, "【一帆雀庄】", "一帆"], ["四川省", "成都市", 1, "【東雲研究所】", "東雲"], ["四川省", "成都市", 1, "【成都立直雀庄】", "立直雀庄"], ["四川省", "自贡市", 1, "【大四喜麻将馆】自贡市立直麻雀联盟", "大四喜"], ["广东省", "珠海市", 1, "雀喵立直", "雀喵立直"], ["广东省", "惠州市", 1, "惠州肆玖雀庄", "肆玖"], ["广西壮族自治区", "梧州市", 1, "彦纪の小屋", "彦纪"], ["广西壮族自治区", "柳州市", 1, "风子的麻将室", "风子"], ["安徽省", "宣城市", 1, "安徽浪速·宣城国购店", "宣城浪速"], ["湖北省", "武汉市", 1, "夏天立直雀庄", "夏天"], ["浙江省", "杭州市", 1, "杭州牌浪屋", "牌浪屋"], ["浙江省", "杭州市", 1, "四喜雀庄", "四喜"], ["浙江省", "温州市", 1, "东元雀庄", "东元"], ["浙江省", "杭州市", 1, "见独麻雀·南苑道场", "见独"], ["浙江省", "杭州市", 1, "见独麻雀·信义道场", "见独"], ["浙江省", "杭州市", 1, "自勝雀庄", "自胜"], ["浙江省", "杭州市", 1, "鹿鸣雀庄", "鹿鸣"], ["贵州省", "贵阳市", 1, "玄学麻雀部屋", "玄学"], ["北京市", "北京市", 1, "鸭川-朝外SOHO店", "鸭川"], ["辽宁省", "大连市", 1, "大连鸭川雀庄", "鸭川"], ["浙江省", "杭州市", 1, "下沙·鸭川雀庄", "鸭川"], ["北京市", "北京市", 1, "鸭川-牡丹园店", "鸭川"]];
function text2number(list) {
	var new_list = [];
	for (let i = 0; i < list.length; i++) {
		const raw = list[i];
		raw[0] += '';
		raw[1] += '';
		var area2 = raw[0].substring(0, 2);
		var num = -1;
		var num2 = -1;
		var subarea2 = raw[1].substring(0, 2);

		for (let j = 0; j < area2text.length; j++) {
			if (area2text[j].startsWith(area2)) {
				num = j;
			};
		}
		for (let j = 0; j < subarea2text[num].length; j++) {
			if (subarea2text[num][j].startsWith(subarea2)) {
				num2 = j;
			};
		}

		raw[0] = num;
		raw[1] = num2;
		new_list[i] = raw;
	}
	return new_list;
}
JSON.stringify(text2number(list));

/*
var area2text = [];
var subarea2text=[]
var i=0;
for (const area in pc) {
		if (Object.hasOwnProperty.call(pc, area)) {
				area2text[i]=area;
				subarea2text[i] = pc[area];
		}
		i++;
}
JSON.stringify(area2text);

*/